Revit 2024 API
BuiltInFailures.SiteImportFailures.TooFewPoints Property
 The toposolid must have at least three distinct points
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TooFewPoints { get; }
Visual Basic
Public Shared ReadOnly Property TooFewPoints As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TooFewPoints {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteImportFailures Class
Autodesk.Revit.DB Namespace